In [1]:
import pandas as pd
data = [1, 2, 3, 4]
df = pd.DataFrame(data)
df

   0
0  1
1  2
2  3
3  4

In [3]:
dictionary = {
    'Buah':['Apel', 'Jeruk', 'Lemon'], 
    'Jumlah':[1, 5, 12]
    }
df = pd.DataFrame(dictionary)
df

    Buah  Jumlah
0   Apel       1
1  Jeruk       5
2  Lemon      12

In [7]:
data = [
    ['Ritshu', 80, 85, 90, 86.6],
    ['Mangifera', 90, 85, 95, 90.5],
    ['Wijel', 70, 75, 80, 78.5],
    ['Yadi', 90, 90, 90, 90.0]
]
index = [0, 1, 2, 3]
kolom = ['Nama', 'Tugas', 'UTS', 'UAS', 'Rata-Rata']
df = pd.DataFrame(data, index, kolom)
df

        Nama  Tugas  UTS  UAS  Rata-Rata
0     Ritshu     80   85   90       86.6
1  Mangifera     90   85   95       90.5
2      Wijel     70   75   80       78.5
3       Yadi     90   90   90       90.0

In [ ]:
nama = ['Ritshu', 'Mangifera', 'Wijel', 'Yadi']
tugas = [80, 90, 70, 90]
uts = [85, 90, 75, 90]
uas = [90, 85, 80, 90]
ratarata = [86.6, 90.5, 78.5, 90.0]
df2 = pd.DataFrame({
    'Nama':nama,
    'Tugas':tugas,
    'UTS':uts,
    'UAS':uas,
    'Rata-Rata':ratarata
})
df2